#!/usr/bin/env bash

# Расположение ключа и пользователя домена для подключения
PRIVATE_KEY="/vagrant/ansible/roles/ipaserver/files/id_rsa"
SSH_USER="wildway@wildway.lan"

# Простая проверка выполнения задачи
echo -e "\n\n"
echo "===== Начало работы скрипта проверки ================="

echo -e "\n\n"
echo "======================================================"
echo "===== Данные о сконфигурированном домене: `realm list`"

echo -e "\n\n"
echo "===== Проверка подключения ==========================="
echo "===== Будет использована доменная учетная запись ====="
ssh -o "StrictHostKeyChecking=no" -i $PRIVATE_KEY -l $SSH_USER localhost -n "
echo '===== Подключение успешно';
echo '===== Имя хоста: '; hostname;
echo '===== Имя пользователя: '; whoami;
echo '===== Текущая директория:'; pwd;
" 2>/dev/null
echo "======================================================"

echo -e "\n\n"
echo "======================================================"
echo "===== Для самостоятельной проверки используйте: ======"
echo "===== Имя пользователя - $SSH_USER"
echo "===== IP адрес сервера - 192.168.11.250"
echo "===== IP адрес клиента - 192.168.11.251"
echo "===== Расположение ключа - ansible/roles/ipaserver/files/id_rsa"
echo "======================================================"

echo -e "\n\n"
echo "======================================================"
echo "===== Команды для самостоятельного подключения: ======"
echo "======= Подключение к серверу:"
echo "ssh -o 'StrictHostKeyChecking=no' -i ansible/roles/ipaserver/files/id_rsa -l $SSH_USER 192.168.11.250"
echo "======= Подключение к клиенту:"
echo "ssh -o 'StrictHostKeyChecking=no' -i ansible/roles/ipaserver/files/id_rsa -l $SSH_USER 192.168.11.251"
echo "======================================================"

echo -e "\n\n"
echo "======================================================"
echo "===== Для подключения к web-gui FreeIPA необходимо: =="
echo "===== Вариант 1) Прописать в качестве dns - 192.168.11.250"
echo "===== Вариант 2) Добавить в hosts строку '192.168.11.250 ipaserver.wildway.lan ipaserver'"
echo "======================================================"

echo -e "\n\n"
echo "===== Завершение скрипта проверки ===================="
echo "======================================================"
echo -e "\n\n"